app/Http/Controllers/Auth/RegisterController.php

select * from `subjects`
---
    public function registerView()
    {
        $subjects = Subjects::all();