app/Http/Controllers/Authenticated/Calendar/Admin/CalendarsController.php

    public function reserveDetail($date, $part){
        // dd($part);
        $reservePersons = ReserveSettings::with('users')->where('setting_reserve', $date)->where('setting_part', $part)->get();
---
select * from `reserve_settings` where `setting_reserve` = '2023-12-28' and `setting_part` = '2'
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (2) and `users`.`deleted_at` is null