app/Http/Controllers/Authenticated/BulletinBoard/PostsController.php

    public function show(Request $request){
        $posts = Post::with('user','postComments','subCategories')->get();
        $main_categories = MainCategory::get();
        $sub_categories = SubCategory::with('mainCategory')->get();
        $like = new Like;
        $post_comment = new Post;
        if(!empty($request->keyword)){

            $sub_search_word =$request->keyword;
            $sub_category_word = Subcategory::where('sub_category',$sub_search_word)->pluck('sub_category');
            $sub_search_id = SubCategory::where('sub_category',$sub_search_word)->pluck('id');

            $posts = Post::with('user', 'postComments','subCategories')
            ->where('post_title', 'like', '%'.$request->keyword.'%')
            ->orWhere('post', 'like', '%'.$request->keyword.'%')
            ->get();

            // →ここだけ！！$sub_category_wordに入らない！直接指定すると問題ない
            if($sub_search_word == $sub_category_word){
            $posts = Post::with('user', 'postComments','subCategories')
            ->orWhereHas('subCategories', function($q) use ($sub_search_id){
                $q->where('post_sub_categories.sub_category_id',$sub_search_id);
            })->get();
---
select * from `post_comments` where `post_comments`.`post_id` in (21, 22, 24, 25, 26)
select * from `posts`
select * from `users` where `users`.`id` in (5) and `users`.`deleted_at` is null
select `sub_categories`.*, `post_sub_categories`.`post_id` as `pivot_post_id`, `post_sub_categories`.`sub_category_id` as `pivot_sub_category_id` from `sub_categories` inner join `post_sub_categories` on `sub_categories`.`id` = `post_sub_categories`.`sub_category_id` where `post_sub_categories`.`post_id` in (21, 22, 24, 25, 26)
select * from `main_categories`
select * from `main_categories` where `main_categories`.`id` in (2, 4, 5, 6)
select `sub_category` from `sub_categories` where `sub_category` = 'デザイン'
select `id` from `sub_categories` where `sub_category` = 'デザイン'
select * from `post_comments` where `post_comments`.`post_id` in (21)
select * from `posts` where `post_title` like '%デザイン%' or `post` like '%デザイン%'
select `sub_categories`.*, `post_sub_categories`.`post_id` as `pivot_post_id`, `post_sub_categories`.`sub_category_id` as `pivot_sub_category_id` from `sub_categories` inner join `post_sub_categories` on `sub_categories`.`id` = `post_sub_categories`.`sub_category_id` where `post_sub_categories`.`post_id` in (21)
select * from `post_comments` where `post_comments`.`post_id` in (22, 26)
select * from `posts` where exists (select * from `sub_categories` inner join `post_sub_categories` on `sub_categories`.`id` = `post_sub_categories`.`sub_category_id` where `posts`.`id` = `post_sub_categories`.`post_id` and `post_sub_categories`.`sub_category_id` = 3)
select `sub_category` from `sub_categories` where `sub_category` = 'PM'

        }else if($request->category_word){
             $sub_category = $request->category_word;
             $sub_category_id = SubCategory::where('sub_category',$sub_category)->pluck('id');
             $posts = Post::with('subCategories')
             ->whereHas('subCategories', function($q) use ($sub_category_id){
                $q->where('post_sub_categories.sub_category_id',$sub_category_id);
            })->get();
---
select * from `posts` where exists (select * from `sub_categories` inner join `post_sub_categories` on `sub_categories`.`id` = `post_sub_categories`.`sub_category_id` where `posts`.`id` = `post_sub_categories`.`post_id` and `post_sub_categories`.`sub_category_id` = 3)
select * from `main_categories` where `main_categories`.`id` in (2, 4, 5, 6)


        }else if($request->like_posts){
            $likes = Auth::user()->likePostId()->get('like_post_id');
            $posts = Post::with('user', 'postComments')
            ->whereIn('id', $likes)->get();
---
select * from `posts` where `posts`.`id` = '21' limit 1

    public function postDetail($post_id){
        $post = Post::with('user', 'postComments')->findOrFail($post_id);
---
select * from `post_comments` where `post_comments`.`post_id` in (21)
select * from `posts` where `posts`.`id` = '21' limit 1
select * from `users` where `users`.`id` in (5) and `users`.`deleted_at` is null

    public function postInput(){
        $main_categories = MainCategory::get();
        $sub_categories = SubCategory::with('mainCategory')->get();
---
select * from `main_categories`

    public function postCreate(PostFormRequest $request){

        $post = Post::create([
            'user_id' => Auth::id(),
            'post_title' => $request->post_title,
            'post' => $request->post_body,
        ]);
        $sub_category_id = $request->post_category_id;

        $sub_category = SubCategory::find($sub_category_id);
        $sub_category->posts()->attach($post->id);
---
select * from `sub_categories` where `sub_categories`.`id` = '1' limit 1
insert into `post_sub_categories` (`post_id`, `sub_category_id`) values (1, 1)
insert into `posts` (`user_id`, `post_title`, `post`) values (1, '要件定義', 'ユーザー（発注者）の要望をヒアリングしたうえで、その要望を実現するために具体的にどのような方向性・手順でシステムを構築していくべきか、誰が見ても理解できるように文書化する作業のこと')

     public function subCategoryCreate(SubCategoryFormRequest $request){
        SubCategory::create([
            'main_category_id' => $request->main_category_id,
            'sub_category' =>  $request->sub_category
        ]);
---
insert into `sub_categories` (`main_category_id`, `sub_category`) values ('1', '上流工程')

    public function postLike(Request $request){
        $user_id = Auth::id();
        $post_id = $request->post_id;

        $like = new Like;

        $like->like_user_id = $user_id;
        $like->like_post_id = $post_id;
        $like->save();
---
insert into `likes` (`like_user_id`, `like_post_id`, `created_at`) values (3, '2', '2024-01-28 15:34:32')