app/Models/Users/User.php

    public function is_Like($post_id){
        return Like::where('like_user_id', Auth::id())->where('like_post_id', $post_id)->first(['likes.id']);
---
select `likes`.`id` from `likes` where `like_user_id` = 5 and `like_post_id` = 22 limit 1