app/Http/Controllers/Authenticated/Calendar/General/CalendarsController.php

select * from `reserve_settings` where `setting_reserve` = '2024-01-31' and `setting_part` = '2' limit 1
update `reserve_settings` set `limit_users` = `limit_users` - 1 where `id` = 83
---
    public function reserve(Request $request){
        DB::beginTransaction();
        try{
            $getPart = $request->getPart;
            $getDate = $request->getData;
            // array combine→mergeに変更
            $reserveDays = array_filter(array_merge($getDate, $getPart));
            foreach($reserveDays as $key => $value){
                $reserve_settings = ReserveSettings::where('setting_reserve', $key)->where('setting_part', $value)->first();
                $reserve_settings->decrement('limit_users');