app/Models/Posts/Like.php

select * from `likes` where `like_post_id` = 22
---
    public function likeCounts($post_id){
        return $this->where('like_post_id', $post_id)->get()->count();