app/Models/Posts/Post.php

    public function commentCounts($post_id){
        return Post::with('postComments')->find($post_id)->postComments()->count();
---
select * from `post_comments` where `post_comments`.`post_id` in (22)
select count(*) as aggregate from `post_comments` where `post_comments`.`post_id` = 22 and `post_comments`.`post_id` is not null