app/Calendars/Admin/CalendarWeekDay.php

  function onePartFrame($day){
    $one_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '1')->first();
---
select * from `reserve_settings` where `setting_reserve` = '2023-12-13' and `setting_part` = '1' limit 1