app/Calendars/Admin/CalendarWeekDay.php

  function dayPartCounts($ymd){
    $html = [];
    $one_part = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '1')->first();
    $two_part = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '2')->first();
    $three_part = ReserveSettings::with('users')->where('setting_reserve', $ymd)->where('setting_part', '3')->first();

    $html[] = '<div class="text-left">';
    if($one_part){

      $html[] = '<p class="day_part m-0 pt-1">';
      $html[] = '<a href="'. route('calendar.admin.detail', ['date'=> $ymd,'part'=> $one_part->setting_part ]) .'">1部</a>';
      // dd($ymd,$one_part);
      $html[] =  '<span>';
      $html[] =  $one_part->users()->count();
      $html[] =  '</span>';
      $html[] =  '</p>';

    }
    if($two_part){
      $html[] = '<p class="day_part m-0 pt-1">';
      $html[] = '<a href="'. route('calendar.admin.detail', ['date'=> $ymd,'part'=> $two_part->setting_part ]) .'">2部</a>';
      $html[] =  '<span>';
      $html[] =  $two_part->users()->count();
---
select * from `reserve_settings` where `setting_reserve` = '2024-02-01' and `setting_part` = '1' limit 1
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (85) and `users`.`deleted_at` is null
select * from `reserve_settings` where `setting_reserve` = '2024-02-01' and `setting_part` = '2' limit 1
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (86) and `users`.`deleted_at` is null
select * from `reserve_settings` where `setting_reserve` = '2024-02-01' and `setting_part` = '3' limit 1
select `users`.*, `reserve_setting_users`.`reserve_setting_id` as `pivot_reserve_setting_id`, `reserve_setting_users`.`user_id` as `pivot_user_id`, `reserve_setting_users`.`id` as `pivot_id` from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` in (87) and `users`.`deleted_at` is null
select count(*) as aggregate from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` = 85 and `users`.`deleted_at` is null
select count(*) as aggregate from `users` inner join `reserve_setting_users` on `users`.`id` = `reserve_setting_users`.`user_id` where `reserve_setting_users`.`reserve_setting_id` = 86 and `users`.`deleted_at` is null

  function onePartFrame($day){
    $one_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '1')->first();
    if($one_part_frame){
      $one_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '1')->first()->limit_users;
---
select * from `reserve_settings` where `setting_reserve` = '2024-02-01' and `setting_part` = '1' limit 1
select * from `reserve_settings` where `setting_reserve` = '2024-02-04' and `setting_part` = '1' limit 1

  function twoPartFrame($day){
    $two_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '2')->first();
    if($two_part_frame){
      $two_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '2')->first()->limit_users;
---
select * from `reserve_settings` where `setting_reserve` = '2024-02-01' and `setting_part` = '2' limit 1
select * from `reserve_settings` where `setting_reserve` = '2024-02-04' and `setting_part` = '2' limit 1

  function threePartFrame($day){
    $three_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '3')->first();
    if($three_part_frame){
      $three_part_frame = ReserveSettings::where('setting_reserve', $day)->where('setting_part', '3')->first()->limit_users;
---
select * from `reserve_settings` where `setting_reserve` = '2024-02-01' and `setting_part` = '3' limit 1
select * from `reserve_settings` where `setting_reserve` = '2024-02-04' and `setting_part` = '3' limit 1