app/Searchs/SelectNameDetails.php

  public function resultUsers($keyword, $category, $updown, $gender, $role, $subjects){
    if(is_null($gender)){
      $gender = ['1', '2', '3'];
    }else{
      $gender = array($gender);
    }
    if(is_null($role)){
      $role = ['1', '2', '3', '4'];
    }else{
      $role = array($role);
    }

    // ここを変更？
    $users = User::with('subjects')
    ->where(function($q) use ($keyword){
      $q->Where('over_name', 'like', '%'.$keyword.'%')
      ->orWhere('under_name', 'like', '%'.$keyword.'%')
      ->orWhere('over_name_kana', 'like', '%'.$keyword.'%')
      ->orWhere('under_name_kana', 'like', '%'.$keyword.'%');
    })
    ->where(function($q) use ($role, $gender){
      $q->whereIn('sex', $gender)
      ->whereIn('role', $role);
    })
    ->whereHas('subjects', function($q) use ($subjects){
      // ここっぽい！In
      $q->whereIn('subjects.id', $subjects);
    })
    ->orderBy('over_name_kana', $updown)->get();
---
select * from `users` where (`over_name` like '%%' or `under_name` like '%%' or `over_name_kana` like '%%' or `under_name_kana` like '%%') and (`sex` in ('1', '2', '3') and `role` in ('1', '2', '3', '4')) and exists (select * from `subjects` inner join `subject_users` on `subjects`.`id` = `subject_users`.`subject_id` where `users`.`id` = `subject_users`.`user_id` and `subjects`.`id` in ('1', '3')) and `users`.`deleted_at` is null order by `over_name_kana` asc
select `subjects`.*, `subject_users`.`user_id` as `pivot_user_id`, `subject_users`.`subject_id` as `pivot_subject_id` from `subjects` inner join `subject_users` on `subjects`.`id` = `subject_users`.`subject_id` where `subject_users`.`user_id` in (3)